export const updateHistory = [
  {
    version: "0.1.2",
    date: "2025-05-24",
    title: "证明我还活着",
    updates: [
      "【新增】Obsidian同款知识图谱",
      "【新增】两篇读书笔记",
      "【优化】Ubuntu安装教程",
      "【预告】PLC？谁知道呢，好忙/(ㄒoㄒ)/~~"
    ]
  },
  // {
  //   version: "0.1.1",
  //   date: "2025-05-02",
  //   title: "新视频新文章",
  //   updates: [
  //     "【新增】万工理论：机器人介绍",
  //     "【升级】上边栏重构",
  //   ]
  // },
  // {
  //   version: "0.1.0",
  //   date: "2025-04-20",
  //   title: "Astro 版本大更新适配",
  //   updates: [
  //     "【新增】日志弹窗",
  //     "【新增】博客学科分类",
  //     "【升级】网站适配 Astro 版本至5.6.1",
  //     "【预告】筹备中：机器人学理论"
  //   ]
  // }
]; 